<template v-slot:page3>
  <article class="article-inner">
    <div class="article-container">
      <h3 class="headline">About Ueshima</h3>
      <p>上島 宏史（Ueshima Hiroshi）<br>
        現京都コンピュータ学院講師および広報担当。<br>
        元フロントエンドエンジニア、マジシャンなど。</p>
      <h4 class="headline-lv2">誰かが受け入れないと何も変わらないからね</h4>

      <h3 class="headline">Philosophy</h3>
      <p>上島氏が残した名言を記載。<br>
        これを見て元気になってくれる人が私の他に現れれば嬉しい限り。</p>

      <h4 class="headline-lv2">嫌なことが頭から離れない時</h4>
      <p>前にも話しましたが，嫌なことがあるとそればっかり意識しがちで，何も楽しくなくなりますが，<br>
        人生振り返っても，プラスよりマイナスのことが多い人を今まで見たことがありません。<br>
        そう思っている人でも，話をすると，「悪いことを意識して考えすぎるだけ」です。<br>
        解決するために考える時間は有意義ですが，「嫌だ嫌だ！」と考えるのは落ち込むしかないので，<br>
        「過去起こったことで落ち込む時間があるなら，5分先のことを考える」ように心がけてもらえれば，<br>
        モチベーションやメンタルの維持だけでなく，向上につながると思います。</p>

      <h4 class="headline-lv2">自分のことを悪く考えてしまう</h4>
      <p>自分の事を悪く考えるのはカンタンですが，何もメリットがありませんから，今やるべきことに集中することに意識を向けましょう。<br>
        人間は文句も言いますし，感情的にもなるものです。それは「最低な人間」でもなんでもないです。<br>
        前に進むべき時に前に進めるかどうかの判断力と行動力が大切です。自分にもっと自信をもってくださいね。<br>
        自分を悪く言って終わるだけの考えは意味がありませんし，他の誰かに認めてもらうこと以外解決しません。<br>
        そういった考えに時間を使わない「努力」が必要なのかもしれませんね。</p>
    </div>
  </article>
</template>

<script>
import './styles_article.css'

export default {
  name: "Article4",
}
</script>